In [2]:
import pandas as pd

In [3]:
students = pd.DataFrame({
  "name" : ["Kate", "John", "Tom", "Mark"],
  "age" : [20, 21, 19, 18]
})

In [11]:
company_1 = pd.DataFrame([
    {"id": "e1", "date": "201801", "salary": 1000000},
    {"id": "e1", "date": "201802", "salary": 1100000},
    {"id": "e1", "date": "201803", "salary": 1200000},
])

In [13]:
company_1.set_index(["id", "date"])

            salary
id date
e1 201801  1000000
   201802  1100000
   201803  1200000

In [14]:
company_2 = pd.DataFrame([
    {"id": "e1", "date": "201801", "salary": 2000000},
    {"id": "e1", "date": "201802", "salary": 3000000}
])

In [16]:
company_2.set_index(["id", "date"])

            salary
id date
e1 201801  2000000
   201802  3000000

In [24]:
df = pd.concat([company_1.set_index(["id", "date"]),company_2.set_index(["id", "date"])])
df

            salary
id date
e1 201801  1000000
   201802  1100000
   201803  1200000
   201801  2000000
   201802  3000000

In [26]:
company_1

     date  id   salary
0  201801  e1  1000000
1  201802  e1  1100000
2  201803  e1  1200000

In [27]:
company_2

     date  id   salary
0  201801  e1  2000000
1  201802  e1  3000000

In [31]:
pd.concat([company_1, company_2]).groupby(["id", "date"]).agg({"salary": "sum"})

            salary
id date
e1 201801  3000000
   201802  4100000
   201803  1200000

In [32]:
import numpy

In [33]:
1 + numpy.nan

nan